#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Sun Jan 20 09:43:06 2019

@author: ubuntu

这部分主要用来重写核心的机器学习算法，通过类的方式完成，便于在本文件调试
"""
# %%    
"""梯度消失或者梯度爆炸的原因，以及数学层面的解释和解决方法？
"""


# %% 
"""解释l0/l1/l2正则化？
"""



# %% 
"""解释不同激活函数的优缺点？
"""



# %% 
"""凸函数概念，求极值方法，为什么用梯度下降而不是牛顿法？
"""


# %% 
"""如何把高维变量映射到低维？
"""



# %% 
"""过拟合与欠拟合的概念，原因，解决办法？
"""

# %% 
"""SVM的的原理，以及python如何实现?
"""



# %% 
"""CNN的算法原理, BP相关理论的python如何实现?
"""
class CNN:
    def __init__(self):
        pass


# %%        深度学习相关
"""1x1卷积的作用?
"""


