#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Sun Jan 20 09:43:06 2019

@author: ubuntu

这部分主要用来从基本概念角度，通过实际代码实践，深刻理解代码
"""
# %%        机器学习
"""熵的概念和计算，以及交叉熵概念，以及交叉熵作为损失函数的意义？
1. 信息熵：
2. 信息增益：
3. 交叉熵：
"""





# %%        机器学习
"""解释l0/l1/l2正则化？
"""



# %%        机器学习
"""解释不同激活函数的优缺点？
1. 激活函数的功能：也叫非线性映射函数，
1. 常见激活函数
    > sigmoid()
    > relu()
    >
2. 
"""
# 如果没有激活函数，无论多少层都只是线性变换




# %%        机器学习
"""凸函数概念，求极值方法，为什么用梯度下降而不是牛顿法？
"""


# %%        机器学习
"""如何把高维变量映射到低维？以及什么是PCA？
"""



# %%        机器学习
"""过拟合与欠拟合的概念，原因，解决办法？
"""

# %%        机器学习
"""SVM的的原理，以及python如何实现?
"""



# %%        机器学习
"""CNN的算法原理, BP相关理论的python如何实现?
"""
class CNN:
    def __init__(self):
        pass


# %%        深度学习与CV
"""卷积的作用?
1. 卷积操作：用来对图像进行过滤，
"""
# 尝试最简单的几种卷积核：可以看到卷积核能够对图像进行过滤

